In [1]:
import pandas as pd

In [2]:
postulantes_edu = pd.read_csv('Sources/fiuba_1_postulantes_educacion_concat.csv')
postulantes_gen = pd.read_csv('Sources/fiuba_2_postulantes_genero_y_edad_concat.csv')

In [3]:
postulantes_edu.drop(['Unnamed: 0'],axis=1,inplace=True)
postulantes_edu.rename(columns={'nombre':'estudio'},inplace=True)
postulantes_edu.head()

  idpostulante        estudio    estado
0         ZjlZ         Master  En Curso
1         NdJl       Posgrado  En Curso
2         5kNq           Otro  En Curso
3         8rYD         Master  En Curso
4         1Wvj  Universitario  En Curso

In [4]:
postulantes_gen.drop(['Unnamed: 0'],axis=1,inplace=True)
postulantes_gen.head()

  idpostulante fechanacimiento        sexo
0          6MM      1985-01-01        MASC
1          Nzz             NaN  NO_DECLARA
2          ZX1             NaN  NO_DECLARA
3          Nq5             NaN  NO_DECLARA
4          ebE      1952-07-07        MASC

In [5]:
estudios = pd.get_dummies(postulantes_edu['estudio'])
for col in estudios.columns:
    estudios.loc[estudios.loc[:,col]==1,col] = postulantes_edu.loc[estudios.loc[:,col]==1,'estado']

In [6]:
estudios.head()

,Doctorado,Master,Otro,Posgrado,Secundario,Terciario/Técnico,Universitario
0,0,En Curso,0,0,0,0,0
1,0,0,0,En Curso,0,0,0
2,0,0,En Curso,0,0,0,0
3,0,En Curso,0,0,0,0,0
4,0,0,0,0,0,0,En Curso

In [7]:
postulantes_edu = postulantes_edu.merge(estudios, left_index=True, right_index=True)
postulantes_edu.drop(['estudio','estado'], axis=1, inplace=True)
postulantes_edu.head()

,idpostulante,Doctorado,Master,Otro,Posgrado,Secundario,Terciario/Técnico,Universitario
0,ZjlZ,0,En Curso,0,0,0,0,0
1,NdJl,0,0,0,En Curso,0,0,0
2,5kNq,0,0,En Curso,0,0,0,0
3,8rYD,0,En Curso,0,0,0,0,0
4,1Wvj,0,0,0,0,0,0,En Curso

In [8]:
estados = ['','Abandonado', 'En Curso', 'Graduado']
for x in range(len(estados)):
    for col in postulantes_edu.columns:
        postulantes_edu.loc[postulantes_edu.loc[:,col]==estados[x],col] = x

In [9]:
groups = postulantes_edu.groupby('idpostulante')

In [10]:
df = pd.DataFrame()

In [11]:
import datetime
df = pd.DataFrame()
i = 0
for indice in groups.indices:
    if i%10000 == 0:
        print(datetime.datetime.now())
        print(i)
    i = i + 1
    aux = groups.get_group(indice).max()
    df = df.append(aux,ignore_index=True)
df.head()

2018-06-13 18:56:12.724401
0
2018-06-13 18:56:33.059449
10000
2018-06-13 18:56:56.495488
20000
2018-06-13 18:57:29.693248
30000
2018-06-13 18:58:11.339739
40000
2018-06-13 18:59:05.869169
50000
2018-06-13 19:00:20.669147
60000
2018-06-13 19:01:48.142864
70000
2018-06-13 19:03:24.063935
80000
2018-06-13 19:05:13.632362
90000
2018-06-13 19:07:20.008264
100000
2018-06-13 19:09:50.068233
110000
2018-06-13 19:12:32.459502
120000
2018-06-13 19:15:26.709343
130000
2018-06-13 19:18:40.630148
140000
2018-06-13 19:22:09.338450
150000
2018-06-13 19:25:47.447546
160000
2018-06-13 19:29:37.824807
170000
2018-06-13 19:33:30.824363
180000
2018-06-13 19:37:31.207194
190000
2018-06-13 19:41:58.558486
200000
2018-06-13 19:46:39.955894
210000
2018-06-13 19:51:23.636538
220000
2018-06-13 19:56:46.287619
230000
2018-06-13 20:02:02.356166
240000
2018-06-13 20:07:39.197313
250000
2018-06-13 20:13:39.685586
260000
2018-06-13 20:20:20.686900
270000
2018-06-13 20:27:17.519082
280000
2018-06-13 20:34:24.431929
290000
2018-06-13 20:41:19.617063
300000
2018-06-13 20:48:11.567015
310000
2018-06-13 20:55:30.455555
320000
2018-06-13 21:02:49.723607
330000
2018-06-13 21:10:08.589139
340000
2018-06-13 21:17:26.194120
350000
2018-06-13 21:25:26.856482
360000
2018-06-13 21:35:09.557155
370000

,Doctorado,Master,Otro,Posgrado,Secundario,Terciario/Técnico,Universitario,idpostulante
0,0.0,0.0,0.0,0.0,0.0,0.0,3.0,0z5Dmrd
1,0.0,0.0,3.0,0.0,3.0,3.0,1.0,0z5JW1r
2,0.0,0.0,0.0,0.0,3.0,0.0,0.0,0z5VvGv
3,0.0,0.0,0.0,0.0,0.0,3.0,1.0,0zB01pE
4,0.0,0.0,0.0,0.0,3.0,3.0,0.0,0zB026d

In [12]:
df.to_csv('Sources/postulantes_proc.csv')